{
  "summary": [
    "Front-end web developer with experience in JavaScript and ReactJS. I approach coding as a form of expression: a paintbrush. And I like to use it to create experiences that help others express themselves too.",
    "I have a backgound in computer engineering and learning sciences, with decade-long practice at the intersection of people and technology. I bring strong skills in team-building and project management that help purpose-driven organizations reach social impact with the best use of technology"
  ],
  "experience": [
    {
      "title": "Scratch",
      "links": {
        "live": "https://scratch.mit.edu/",
        "github": ""
      },
      "description": "Scratch is a programming language and online community for children.",
      "details": [
        "",
        "",
        ""
      ]
    }
  ],
  "skills": [
    "HTML/CSS",
    "JavaScript",
    "Bootstrap",
    "ReactJS",
    "Algorithmic design and data structures",
    "Basic Adobe Photoshop & Illustrator"
  ],
  "work": [
    {
      "organization": "(Independent)",
      "location":"Istanbul & Hatay, Turkey",
      "positions": [
        {
          "title": "Creative Learning Consultant",
          "dates": "2012 - present",
          "details": [
            "Providing consultation on the design of creative learning experiences and educational technologies, with a special experience in working with disadvantaged and refugee communities. Projects include:",
            "Designing and running Salam Culture and Science Center at Al Salam School in Reyhanli/Hatay and providing continuous follow up with the mentors. SCSC provides after-school activities for refugee children (6-12 y/o) where they can explore various topics in the fields of language, art, science, engineering, and even computer programming, in a meaningful context.",
            "Leading the design and operation of Karam House (karamhouse.org), a community innovation makerspace for Syrian refugee teens where they create projects related to their interests while collaborating with their peers and mentors. Responsibilities included setting up Karam House, planning the learning activities, and hiring, training, and evaluating the mentors."
          ]
        }
      ]
    },
    {
      "organization": "MIT Media Lab",
      "location":"Cambridge, MA, USA",
      "positions": [
        {
          "title": "Reasearch Assistant",
          "dates": "2012 - 2014",
          "details": [
            "Working with the Lifelong Kindergarten research group on designing technologies and activities to engage people in creative learning experiences.",
            "Designing creative learning activities that empower young displaced people in Northern Syria to meet their educational and psychological needs."
          ]
        },
        {
          "title": "Member of the MIT Scratch Team",
          "dates": "2012 - 2014",
          "details": [
            "Leading the internationalization of Scratch, coordinating the efforts of an international group of volunteering translators who provided Scratch translations for more than 40 languages.",
            "Helping with connecting Scratch to hardware devices (with focus on Arduino), and exploring how people with diverse backgrounds and interests can build their own customized virtual-physical interactions."
          ]
        }
      ]
    },
    {
      "organization": "National TalentS Co. for Training & Education",
      "location":"Khobar, Saudi Arabia",
      "positions": [
        {
          "title": "Head of Learning",
          "dates": "2011 - 2012",
          "details": [
            "Developing the content and learning journeys for the various interactive learning programs that TalentS provides, and training new trainers and facilitators. Projects include:",
            "Managing a collaboration with the Exploratorium museum of science to bring the Tinkering Studio, an immersive experience that allows participants to engage in investigations of scientific phenomena and make meanigful artifacts.",
            "Training judges and organizers of the local FLL (FIRST LEGO League) robotics competition for youth.",
            "Training teacher-trainers for the Siemens Discovery Box project, an initiative to introduce inquiry-based learning activities in electricity and environment to early science classroom all over the country."
          ]
        }
      ]
    },
    {
      "organization": "The Syrian Computer Society ",
      "location":"Damascus, Syria",
      "positions": [
        {
          "title": "Scientific Coordinator of the Syrian Olympiad in Informatics",
          "dates": "2005 - 2009",
          "details": [
            "Taking part in creating the content for and organizing SOI, the national version of the International Olympiad in Informatics, and providing training and advising on teaching computer programming and algorithms for youth.",
            "Leader of the Syrian delegation participating in the International Olympiad in Informatics for IOI 2007 and IOI 2009."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "title": "Front-End Web Development Program, Flatiron School (2020)",
      "details": [
        "JavaScript & React online program / Re:Coded Istanbul Bootcamp."
      ]
    },
    {
      "title": "SM in Media Arts & Sciences, MIT (2014)",
      "details": [
        "The Lifelong Kindergarten research group, developing new technologies and activities that engage people in creative learning experiences."
      ]
    },
    {
      "title": "BS in Computer Engineering, Damascus University (2009)",
      "details": [

      ]
    }
  ]
}