{
  "summary": [
    "Front-end web developer with experience in JavaScript and ReactJS. I approach coding as a form of expression: a paintbrush. I like to use it to create experiences that help others express themselves too.",
    "I have a background in computer engineering and learning sciences, with a decade’s experience working at the intersection of people and technology. I bring strong skills in team-building and project management that help purpose-driven organizations reach social impact with the best use of technology."
  ],
  "experience": [
    {
      "title": "The REACH Project (Columbia University)",
      "links": {
        "live": "https://col-reach.netlify.app/",
        "gitlab": "https://gitlab.com/istanbulclientprojectsApr2020/columbia-university-reach"
      },
      "description": "A multilingual website for an app that provides refugees in Turkey and Lebanon with access to health literacy and health care information.",
      "details": [
        "Worked with a team, using React with routes, to build a website that provides information about the app.",
        "Utilized Bootstrap for responsive styling.",
        "Added multi-language support and created costume RTL styling."
      ]
    },
    {
      "title": "A.Y.idlbi",
      "links": {
        "live": "https://adlogi.github.io/",
        "github": "https://github.com/adlogi/adlogi.github.io"
      },
      "description": "An online portfolio to share my experience as a front-end developer.",
      "details": [
        "Used React with routes to build multi-page website showing different aspects of the work.",
        "Utilized Bootstrap for responsive styling.",
        "Animated intro page using JavaScript and CSS."
      ]
    },
    {
      "title": "movieXplorer",
      "links": {
        "live": "https://adlogi.github.io/movieXplorer/",
        "github": "https://github.com/adlogi/movieXplorer"
      },
      "description": "A single-page website to search for movies and show information extracted from The Movie Database (TMDb).",
      "details": [
        "Used React to search, fetch, and show lists of movies based on search keywords.",
        "Utilized Bootstrap for styling."
      ]
    },
    {
      "title": "Minesweeper",
      "links": {
        "live": "https://adlogi.github.io/minesweeper/",
        "github": "https://github.com/adlogi/minesweeper"
      },
      "description": "An imitation of Google Play's instant Minesweeper game.",
      "details": [
        "Used vanilla JavaScript and CSS to build the game."
      ]
    },
    {
      "title": "Scratch",
      "links": {
        "live": "https://scratch.mit.edu/",
        "github": "https://github.com/adlogi/scratch-trans"
      },
      "description": "Scratch is a programming language and online community that allows children to program their own interactive stories, games, and animations — and share their creations online.",
      "details": [
        "Used python to create scripts to migrate translations from the old version (Scratch 1.4) to the new one (Scratch 2.0) and manage translations submitted by translators to more than 40 languages.",
        "Alpha-tested RTL and non-roman characters support."
      ]
    }
  ],
  "skills": [
    "HTML/CSS",
    "JavaScript",
    "Bootstrap",
    "ReactJS",
    "Algorithmic design and data structures",
    "Basic Adobe Photoshop & Illustrator"
  ],
  "work": [
    {
      "organization": "(Independent)",
      "location":"Istanbul & Hatay, Turkey",
      "positions": [
        {
          "title": "Creative Learning Consultant",
          "dates": "2014 - present",
          "details": [
            "Providing consultation on the design of creative learning experiences and educational technologies, with a special experience in working with disadvantaged and refugee communities. Projects include:",
            "Salam Culture and Science Center (Reyhanli/Hatay): SCSC provides after-school STEAM activities for refugee children (6-12 y/o). Designed space and activities, providing continuous follow up with the mentors.",
            "Karam House (karamhouse.org): KH is a community innovation makerspace for Syrian refugee teens. Designed space and learning activities, and led hiring, training, and evaluating the mentors."
          ]
        }
      ]
    },
    {
      "organization": "MIT Media Lab",
      "location":"Cambridge, MA, USA",
      "positions": [
        {
          "title": "Research Assistant",
          "dates": "2012 - 2014",
          "details": [
            "Worked with the Lifelong Kindergarten research group on designing technologies and activities to engage people in creative learning experiences.",
            "Designed creative learning activities that empower young displaced people in Northern Syria to meet their educational and psychological needs."
          ]
        },
        {
          "title": "Member of the MIT Scratch Team",
          "dates": "2012 - 2014",
          "details": [
            "Led the internationalization of Scratch, coordinating the efforts of an international group of volunteering translators who provided translations of Scratch 2.0 editor and website to more than 40 languages.",
            "Helped with connecting Scratch to hardware devices (with focus on Arduino), and exploring how people with diverse backgrounds and interests can build their own customized virtual-physical interactions.",
            "Published work: Dasgupta, S., Clements, S. M., idlbi, A. Y., Willis-Ford, C., and Resnick, M. (2015). \"Extending Scratch: New Pathways into Programming.\" Proceedings of IEEE Symposium on Visual Languages and Human-Centric Computing (VLHCC ’15)."
          ]
        }
      ]
    },
    {
      "organization": "National TalentS Co. for Training & Education",
      "location":"Khobar, Saudi Arabia",
      "positions": [
        {
          "title": "Head of Learning",
          "dates": "2011 - 2012",
          "details": [
            "Developed the content and learning journeys for the various interactive learning programs that TalentS provides, and trained new trainers and facilitators",
            "Duties included project managing a collaboration with the Exploratorium museum of science, training judges and organizers of the local FLL (FIRST LEGO League) robotics competition for youth, and training teacher-trainers for a country-wide program to introduce inquiry-based learning activities to early science classrooms"
          ]
        }
      ]
    },
    {
      "organization": "The Syrian Computer Society ",
      "location":"Damascus, Syria",
      "positions": [
        {
          "title": "Scientific Coordinator of the Syrian Olympiad in Informatics",
          "dates": "2005 - 2009",
          "details": [
            "Took part in creating the content for and organizing SOI, the national version of the International Olympiad in Informatics, and trained and advised on teaching computer programming and algorithms for youth.",
            "Leader of the Syrian delegation participating in the International Olympiad in Informatics for IOI 2007 and IOI 2009."
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "title": "Front-End Web Development Program, Re:Coded Bootcamp / Flatiron School (2020)",
      "details": [
        "Front-End Web Development using JavaScript, Bootstrap, and ReactJS"
      ]
    },
    {
      "title": "SM in Media Arts & Sciences, MIT (2014)",
      "details": [
        "The Lifelong Kindergarten research group, developing new technologies and activities that engage people in creative learning experiences."
      ]
    },
    {
      "title": "BS in Computer Engineering, Damascus University (2009)",
      "details": [

      ]
    }
  ]
}